/* 
hoisting মূলত যখন আমরা কোনো একটি ভ্যারিয়েবল var দিয়ে ডিক্লেয়ার করি। তখন সেই ডিক্লেয়ার ভ্যারিয়াবল টা
বিহাইন্ড দা সিনে সবার উপরে ডিক্লেয়ার হয়। এই জন্য আমরা সেকেন্ড ব্র্যাকেট এর ভিতরে var দিয়ে ভ্যারিয়েবল ডিক্লেয়ার
করলে সেটি global হয়ে উপরে ডিক্লেয়ার হয়ে যায়। এবং আমরা যেকোনো জায়গা থেক use করতে পারি।


আমরা যখন রেগুলার ফাংশন ডিক্লেয়ার করি তখন সেটা hoisting এর মাধ্যমে উপরে ডিক্লেয়ার হয়ে যায়।
এবং আমরা যেকোনো জায়গা থেকে সেই ফাংশনকে কল করতে পারি। 
*/
add()
function add(){
    console.log('sourav')
    // sourav
}


/* 
নিচের মতো এটা var দিয়ে তার পর ফাংশন এক্সপ্রেশন ডিক্লেয়ার করলে সেটাকে আবার যেকোনো জায়গা থেকে
কল করা যাবে। না। কারন রেগুলার ফাংশন নিজেই গ্লোবাল ভাবে hoisting হবে উপরে সেট হয়ে যাবে। তখন var 
ভ্যারিয়েবল এর ভ্যালু undefine হয়ে যাবে। আর undefine কোনো ফাংশন না। তাই তাকে কল করা যাবে না।
কল করতে হলে যেখানে ফাংশঙ্কে ডিক্লেয়ার করবো তার পর থেকে কল করতে হবে।

*/
adding()
var adding = function(){
    console.log('hello')
    // error 
}
